# TessellatedFace Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedFace Class
Members See Also
---
Defines a planar face bounded by a polyline in 3d space. A face consists of a single connected component and can have holes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class TessellatedFace : IDisposable
```

Visual Basic
---
```text
Public Class TessellatedFace _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TessellatedFace : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TessellatedFace
# See Also
TessellatedFace Members
Autodesk.Revit.DB Namespace